# Ficha de trabalho 1
1 - Considera o ficheiro **notas.csv** com a classificação de algumas disciplinas do curso de bioinformática.
Importa os dados para um objeto do tipo pandas.DataFrame

In [4]:
import numpy as np
import pandas as pd
df = pd.read_csv("notas.xls")
df

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas
0     João          12.0             16.0                17.0
1    Carla          17.0             16.0                 NaN
2    Sónia           NaN             18.0                18.0
3    Pedro          16.0              NaN                18.0
4     José          14.0             17.0                12.0
5   Carina          19.0             18.0                20.0
6    Telma          16.0             14.0                12.0
7  Joaquim           NaN             15.0                12.0
8  Ricardo          15.0             15.0                14.0
9    Vanda          16.0             15.0                18.0

2 - Ordena a informação pela ordem alfabética dos nomes.

In [5]:
df.sort_values('Nome', ascending = True)

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas
5   Carina          19.0             18.0                20.0
1    Carla          17.0             16.0                 NaN
7  Joaquim           NaN             15.0                12.0
4     José          14.0             17.0                12.0
0     João          12.0             16.0                17.0
3    Pedro          16.0              NaN                18.0
8  Ricardo          15.0             15.0                14.0
2    Sónia           NaN             18.0                18.0
6    Telma          16.0             14.0                12.0
9    Vanda          16.0             15.0                18.0

3 - Calcula a média de cada uma das disciplinas.

In [6]:
df.describe()

       Laboratórios   Alg. Avançados   Biologia Sistemas
count      8.000000         9.000000            9.000000
mean      15.625000        16.000000           15.666667
std        2.065879         1.414214            3.162278
min       12.000000        14.000000           12.000000
25%       14.750000        15.000000           12.000000
50%       16.000000        16.000000           17.000000
75%       16.250000        17.000000           18.000000
max       19.000000        18.000000           20.000000

4 - Seleciona o nome dos alunos com classificação igual ou superior 16 na disciplina de Laboratórios.

In [7]:
df[df.iloc[:,1]>16]

     Nome  Laboratórios   Alg. Avançados   Biologia Sistemas
1   Carla          17.0             16.0                 NaN
5  Carina          19.0             18.0                20.0

5 - Cria uma nova coluna com a média de cada um dos alunos nas 3 disciplinas.

In [8]:
df['média'] = df.mean(numeric_only=True, axis=1)
df

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas      média
0     João          12.0             16.0                17.0  15.000000
1    Carla          17.0             16.0                 NaN  16.500000
2    Sónia           NaN             18.0                18.0  18.000000
3    Pedro          16.0              NaN                18.0  17.000000
4     José          14.0             17.0                12.0  14.333333
5   Carina          19.0             18.0                20.0  19.000000
6    Telma          16.0             14.0                12.0  14.000000
7  Joaquim           NaN             15.0                12.0  13.500000
8  Ricardo          15.0             15.0                14.0  14.666667
9    Vanda          16.0             15.0                18.0  16.333333

6 - Considera a seguinte informação adicional.
```python
Sexo = ['M','F','F','M','M','F','F','M','M','F']
Idade = [23,21,25,21,22,23,21,20,27,21]
```
Constroi um novo DataFrame (df2) com a informação adicional dos alunos.

In [9]:
df2 = df.copy()
df2['Sexo'] = ['M','F','F','M','M','F','F','M','M','F']
df2['Idade'] = [23,21,25,21,22,23,21,20,27,21]
df2

,Nome,Laboratórios,Alg. Avançados,Biologia Sistemas,média,Sexo,Idade
0,João,12.0,16.0,17.0,15.000000,M,23
1,Carla,17.0,16.0,NaN,16.500000,F,21
2,Sónia,NaN,18.0,18.0,18.000000,F,25
3,Pedro,16.0,NaN,18.0,17.000000,M,21
4,José,14.0,17.0,12.0,14.333333,M,22
5,Carina,19.0,18.0,20.0,19.000000,F,23
6,Telma,16.0,14.0,12.0,14.000000,F,21
7,Joaquim,NaN,15.0,12.0,13.500000,M,20
8,Ricardo,15.0,15.0,14.0,14.666667,M,27
9,Vanda,16.0,15.0,18.0,16.333333,F,21

7 - Compila a informação presente nos dois DataFrames (df e df2) num único DataFrame.

In [10]:
new_info = df2.iloc[:,-2:]
df3 = df.join(new_info)
df3

,Nome,Laboratórios,Alg. Avançados,Biologia Sistemas,média,Sexo,Idade
0,João,12.0,16.0,17.0,15.000000,M,23
1,Carla,17.0,16.0,NaN,16.500000,F,21
2,Sónia,NaN,18.0,18.0,18.000000,F,25
3,Pedro,16.0,NaN,18.0,17.000000,M,21
4,José,14.0,17.0,12.0,14.333333,M,22
5,Carina,19.0,18.0,20.0,19.000000,F,23
6,Telma,16.0,14.0,12.0,14.000000,F,21
7,Joaquim,NaN,15.0,12.0,13.500000,M,20
8,Ricardo,15.0,15.0,14.0,14.666667,M,27
9,Vanda,16.0,15.0,18.0,16.333333,F,21

8 - A média da notas das raparigas é mais alta, em comparação com a dos rapazes, na disciplina de Biologia Sistemas?

In [11]:
f = df3.loc[df3['Sexo'] == "F"]
f_mean = f.mean(numeric_only=True, axis=0)
m = df3.loc[df3['Sexo'] == "M"]
m_mean = m.mean(numeric_only=True, axis=0)
print(f"A média em BS nas raparidas é %s e nos rapazes é %s." %(f_mean, m_mean))

A média em BS nas raparidas é Laboratórios          17.000000
 Alg. Avançados       16.200000
 Biologia Sistemas    17.000000
média                 16.766667
Idade                 22.200000
dtype: float64 e nos rapazes é Laboratórios          14.25
 Alg. Avançados       15.75
 Biologia Sistemas    14.60
média                 14.90
Idade                 22.60
dtype: float64.

9 - Remove do DataFrame os alunos que têm disciplinas em atraso. Coloca o resultado em df3. Os alunos com disciplinas em atraso têm valor omisso nessa coluna.

In [12]:
df_aproved = df.dropna(axis=0)
df_aproved

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas      média
0     João          12.0             16.0                17.0  15.000000
4     José          14.0             17.0                12.0  14.333333
5   Carina          19.0             18.0                20.0  19.000000
6    Telma          16.0             14.0                12.0  14.000000
8  Ricardo          15.0             15.0                14.0  14.666667
9    Vanda          16.0             15.0                18.0  16.333333

10 - Cria uma tabela pivot que apresente a média das notas de Laboratórios agrupada por idades para ambos os sexos.

In [13]:
df_pv = df3.dropna(axis=0)
pd.pivot_table(df_pv, values='Laboratórios', index=['Sexo'], columns=['Idade'])

Idade    21    22    23    27
Sexo
F      16.0   NaN  19.0   NaN
M       NaN  14.0  12.0  15.0

11 - Adiciona uma nova coluna que indique se o aluno tem bolsa de Mérito ou não. Para ter bolsa de Mérito o aluno não pode ter disciplinas em atraso e média tem que ser superior a 17 valores. Explora a função **apply**.

In [14]:
df_aproved["Bolsa de Mérito"] = df_aproved['média'].apply(lambda val: "Sim" if val >= 17 else "Não")
df_aproved

C:\Users\anaca\AppData\Local\Temp\ipykernel_2864\2724999710.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_aproved["Bolsa de Mérito"] = df_aproved['média'].apply(lambda val: "Sim" if val >= 17 else "Não")

,Nome,Laboratórios,Alg. Avançados,Biologia Sistemas,média,Bolsa de Mérito
0,João,12.0,16.0,17.0,15.000000,Não
4,José,14.0,17.0,12.0,14.333333,Não
5,Carina,19.0,18.0,20.0,19.000000,Sim
6,Telma,16.0,14.0,12.0,14.000000,Não
8,Ricardo,15.0,15.0,14.0,14.666667,Não
9,Vanda,16.0,15.0,18.0,16.333333,Não